// Task 1 ============================================
/* Створіть функцію fn1, яка записує в LocalStorage ключ 5 зі значенням 11. Перевірте, що відбувається при повторному виклику функції. Запускається функція настисканням кнопки .btn-1. */

function fn1() {}

// подію вказуємо нижче ⬇️

// Task 2 ============================================
/* Створіть функцію fn2, яка записує в LocalStorage масив arr2 = [7,6,5]. Ключ arr2. Перевірте, що відбувається під час повторного виклику функції. Запускається функція настисканням кнопки .btn-2. */

function fn2() {}

// подію вказуємо нижче ⬇️

// Task 3 ============================================
/*  При натисканні кнопки .btn-3 виведіть із LocalStorage збережений масив arr2. Виведіть у .output-3 у форматі ключ пропуск значення перенесення рядка.  */

function fn3() {}

// подію вказуємо нижче ⬇️

// Task 4 ============================================
/*  Створіть функцію fn4, яка записує в LocalStorage обʼєкт arr4 = {hello: world, hi:mahai}. Ключ arr4. Перевірте, що відбувається під час повторного виклику функції. Запускається функція настисканням кнопки .btn-4. */

function fn4() {}

// подію вказуємо нижче ⬇️

// Task 5 ============================================
/*   При натисканні кнопки .btn-5 виведіть із LocalStorage збережений масив arr4. Виведіть  дані в .output-5 у форматі у форматі ключ | пробіл | значення | перенесення рядка. */

function fn5() {}

// подію вказуємо нижче ⬇️

// Task 6 ============================================
/*  Створіть функцію fn6, яка очищає весь LocalStorage. Запуск по кнопці .btn-6 */

function fn6() {}

// подію вказуємо нижче ⬇️

// Task 7 ============================================
/*  Створіть input.field-7 куди користувач може вводити числа та рядки. Створіть масив arr7. Коли користувач натискає кнопку .btn-7, дані повинні додаватися в масив. Масив повинен зберігатися в LocalStorage із ключем arr7. */

function fn7() {}

// подію вказуємо нижче ⬇️

// Task 8 ============================================
/* Створіть функцію fn8 під час запуску якої з arr7 видаляється останній елемент. Після цього масив зберігається в LocalStorage з ключем arr7. Використовувати масив із попереднього завдання. */

function fn8() {}

// подію вказуємо нижче ⬇️
