// Task 1 ==================
/* Створіть функцію fn1, яка записує в LocalStorage ключ 5 зі значенням 11. Перевірте, що відбувається при повторному виклику функції. Запускається функція кнопкою btn-1. */

function fn1() {}
// подію записуємо нижче

// Task 2 ==================
/* Створіть функцію fn2, яка записує в LocalStorage масив a2 = [7,6,5]. Ключ a2. Перевірте, що відбувається під час повторного виклику функції. Запускається ф-я кнопкою btn-2. */

function fn2() {}
// подію записуємо нижче

// Task 3 ==================
/* При натисканні кнопки btn-3 виведіть із LocalStorage збережений масив a2. Вивід в out-3 у форматі ключ пробіл значення перенесення рядка <br>. */

function fn3() {}
// подію записуємо нижче

// Task 4 ==================
/*  Створіть функцію fn4, яка записує в LocalStorage об'єкт a4 = {theme: "light", sidebar: "expanded"}. Ключ a4. Перевірте, що відбувається під час повторного виклику функції. Запускається ф-я кнопкою btn-4. */

function fn4() {}
// подію записуємо нижче

// Task 5 ==================
/* При натисканні кнопки btn-5 виведіть із LocalStorage збережений масив a4. Виведіть у out-5 у форматі ключ пробіл значення перенесення рядка <br>. */

function fn5() {}
// подію записуємо нижче

// Task 6 ==================
/* Створіть функцію fn6, яка очищає весь LocalStorage. Запуск кнопкою btn-6 */

function fn6() {}
// подію записуємо нижче

// Task 7 ==================
/* Створіть input field-7, куди користувач може вводити числа і рядки. Створіть масив a7. Коли користувач натискає кнопку btn-7, дані повинні додаватися в масив. Масив повинен зберігатися в LocalStorage із ключем a7.*/
const a7 = [];

function fn7() {}
// подію записуємо нижче

// Task 8 ==================
/*  Створіть функцію fn8 під час запуску якої з a7 видаляється останній елемент. Після цього масив зберігається в LocalStorage з ключем a7. Використати масив із попереднього завдання. */

function fn8() {
  console.log(a7);
}
// подію записуємо нижче
